; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_19_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 - counter
	)
  (:init
		(= (value c0) 67)
	(= (value c1) 86)
	(= (value c2) 54)
	(= (value c3) 25)
	(= (value c4) 33)
	(= (value c5) 49)
	(= (value c6) 3)
	(= (value c7) 70)
	(= (value c8) 96)
	(= (value c9) 60)
	(= (value c10) 31)
	(= (value c11) 5)
	(= (value c12) 68)
	(= (value c13) 84)
	(= (value c14) 81)
	(= (value c15) 65)
	(= (value c16) 97)
	(= (value c17) 18)
	(= (value c18) 60)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
		)
	)
)

; plan
1. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 9 of 18
2. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 9 of 18
3. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 9 of 18
4. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 9 of 18
5. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 9 of 18
6. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 9 of 18
7. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 9 of 18
8. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 9 of 18
9. (increment c14)
   changed: (value c14) from 81 to 85
   goals met: 10 of 18
10. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 10 of 18
11. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 10 of 18
12. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 10 of 18
13. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 10 of 18
14. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 10 of 18
15. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 10 of 18
16. (increase_rate c17)
   changed: (rate_value c17) from 6 to 7
   goals met: 10 of 18
17. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 10 of 18
18. (decrement c14)
   changed: (value c14) from 85 to 80
   goals met: 9 of 18
19. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 9 of 18
20. (decrement_rate c9)
   changed: (rate_value c9) from 1 to 0
   goals met: 9 of 18
21. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 9 of 18
22. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 9 of 18
23. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 9 of 18
24. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 9 of 18
25. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 9 of 18
26. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 18
27. (decrement_rate c2)
   changed: (rate_value c2) from 1 to 0
   goals met: 9 of 18
28. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 18
29. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 18
30. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 18
31. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 18
32. (decrement c8)
   changed: (value c8) from 96 to 90
   goals met: 9 of 18
33. (decrement c8)
   changed: (value c8) from 90 to 84
   goals met: 9 of 18
34. (decrement c8)
   changed: (value c8) from 84 to 78
   goals met: 9 of 18
35. (decrement c8)
   changed: (value c8) from 78 to 72
   goals met: 9 of 18
36. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 9 of 18
37. (decrement c8)
   changed: (value c8) from 72 to 65
   goals met: 8 of 18
38. (increase_rate c17)
   changed: (rate_value c17) from 7 to 8
   goals met: 8 of 18
39. (increase_rate c17)
   changed: (rate_value c17) from 8 to 9
   goals met: 8 of 18
40. (increment c17)
   changed: (value c17) from 18 to 27
   goals met: 8 of 18
41. (increase_rate c17)
   changed: (rate_value c17) from 9 to 10
   goals met: 8 of 18
42. (increment c17)
   changed: (value c17) from 27 to 37
   goals met: 8 of 18
43. (increment c17)
   changed: (value c17) from 37 to 47
   goals met: 8 of 18
44. (increment c17)
   changed: (value c17) from 47 to 57
   goals met: 8 of 18
45. (increment c17)
   changed: (value c17) from 57 to 67
   goals met: 7 of 18
46. (increment c17)
   changed: (value c17) from 67 to 77
   goals met: 7 of 18
47. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 7 of 18
48. (increment c15)
   changed: (value c15) from 65 to 68
   goals met: 7 of 18
49. (increment c14)
   changed: (value c14) from 80 to 85
   goals met: 8 of 18
50. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 8 of 18
51. (increment c15)
   changed: (value c15) from 68 to 72
   goals met: 8 of 18
52. (decrement c14)
   changed: (value c14) from 85 to 80
   goals met: 7 of 18
53. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 18
54. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 18
55. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 18
56. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 18
57. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 18
58. (increment c11)
   changed: (value c11) from 5 to 10
   goals met: 7 of 18
59. (increment c11)
   changed: (value c11) from 10 to 15
   goals met: 7 of 18
60. (increment c11)
   changed: (value c11) from 15 to 20
   goals met: 7 of 18
61. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 7 of 18
62. (increment c11)
   changed: (value c11) from 20 to 26
   goals met: 7 of 18
63. (increment c11)
   changed: (value c11) from 26 to 32
   goals met: 8 of 18
64. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 8 of 18
65. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 8 of 18
66. (decrement c1)
   changed: (value c1) from 86 to 79
   goals met: 8 of 18
67. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 8 of 18
68. (decrement c1)
   changed: (value c1) from 79 to 71
   goals met: 8 of 18
69. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 8 of 18
70. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 8 of 18
71. (decrement c1)
   changed: (value c1) from 71 to 61
   goals met: 7 of 18
72. (increment c15)
   changed: (value c15) from 72 to 76
   goals met: 7 of 18
73. (increment c15)
   changed: (value c15) from 76 to 80
   goals met: 7 of 18
74. (increment c15)
   changed: (value c15) from 80 to 84
   goals met: 8 of 18
75. (increment c14)
   changed: (value c14) from 80 to 85
   goals met: 8 of 18
76. (increment c15)
   changed: (value c15) from 84 to 88
   goals met: 9 of 18
77. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 18
78. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 18
79. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 18
80. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 9 of 18
81. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 9 of 18
82. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 9 of 18
83. (increment c10)
   changed: (value c10) from 31 to 37
   goals met: 8 of 18
84. (increment c11)
   changed: (value c11) from 32 to 38
   goals met: 9 of 18
85. (increment c10)
   changed: (value c10) from 37 to 43
   goals met: 8 of 18
86. (increment c10)
   changed: (value c10) from 43 to 49
   goals met: 8 of 18
87. (increment c11)
   changed: (value c11) from 38 to 44
   goals met: 8 of 18
88. (increment c11)
   changed: (value c11) from 44 to 50
   goals met: 9 of 18
89. (increment c10)
   changed: (value c10) from 49 to 55
   goals met: 8 of 18
90. (increment c11)
   changed: (value c11) from 50 to 56
   goals met: 9 of 18
91. (increment c10)
   changed: (value c10) from 55 to 61
   goals met: 9 of 18
92. (increment c11)
   changed: (value c11) from 56 to 62
   goals met: 10 of 18
93. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 10 of 18
94. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 10 of 18
95. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 10 of 18
96. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 10 of 18
97. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 10 of 18
98. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 10 of 18
99. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 10 of 18
100. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 10 of 18
101. (increment c6)
   changed: (value c6) from 3 to 11
   goals met: 10 of 18
102. (increment c6)
   changed: (value c6) from 11 to 19
   goals met: 10 of 18
103. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 10 of 18
104. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 10 of 18
105. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 10 of 18
106. (increment c6)
   changed: (value c6) from 19 to 28
   goals met: 10 of 18
107. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 10 of 18
108. (increment c6)
   changed: (value c6) from 28 to 38
   goals met: 10 of 18
109. (increment c6)
   changed: (value c6) from 38 to 48
   goals met: 10 of 18
110. (increment c6)
   changed: (value c6) from 48 to 58
   goals met: 11 of 18
111. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 11 of 18
112. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 11 of 18
113. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 11 of 18
114. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 11 of 18
115. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 11 of 18
116. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 11 of 18
117. (increment c3)
   changed: (value c3) from 25 to 31
   goals met: 11 of 18
118. (increment c3)
   changed: (value c3) from 31 to 37
   goals met: 10 of 18
119. (increment c3)
   changed: (value c3) from 37 to 43
   goals met: 10 of 18
120. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 10 of 18
121. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 10 of 18
122. (increment c3)
   changed: (value c3) from 43 to 49
   goals met: 10 of 18
123. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 10 of 18
124. (increment c4)
   changed: (value c4) from 33 to 36
   goals met: 10 of 18
125. (increment c3)
   changed: (value c3) from 49 to 55
   goals met: 11 of 18
126. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 18
127. (increment c4)
   changed: (value c4) from 36 to 40
   goals met: 11 of 18
128. (decrement c3)
   changed: (value c3) from 55 to 49
   goals met: 10 of 18
129. (increment c4)
   changed: (value c4) from 40 to 44
   goals met: 10 of 18
130. (increment c4)
   changed: (value c4) from 44 to 48
   goals met: 10 of 18
131. (increment c3)
   changed: (value c3) from 49 to 55
   goals met: 11 of 18
132. (increment c4)
   changed: (value c4) from 48 to 52
   goals met: 10 of 18
133. (increment c5)
   changed: (value c5) from 49 to 51
   goals met: 10 of 18
134. (increment c5)
   changed: (value c5) from 51 to 53
   goals met: 11 of 18
135. (increment c4)
   changed: (value c4) from 52 to 56
   goals met: 11 of 18
136. (increment c5)
   changed: (value c5) from 53 to 55
   goals met: 11 of 18
137. (increment c5)
   changed: (value c5) from 55 to 57
   goals met: 12 of 18
138. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 12 of 18
139. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 12 of 18
140. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 12 of 18
141. (increase_rate c18)
   changed: (rate_value c18) from 3 to 4
   goals met: 12 of 18
142. (increment c18)
   changed: (value c18) from 60 to 64
   goals met: 12 of 18
143. (increment c18)
   changed: (value c18) from 64 to 68
   goals met: 12 of 18
144. (increment c18)
   changed: (value c18) from 68 to 72
   goals met: 12 of 18
145. (increment c18)
   changed: (value c18) from 72 to 76
   goals met: 12 of 18
146. (increment c18)
   changed: (value c18) from 76 to 80
   goals met: 13 of 18
147. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 13 of 18
148. (increment c17)
   changed: (value c17) from 77 to 87
   goals met: 12 of 18
149. (increment c18)
   changed: (value c18) from 80 to 84
   goals met: 12 of 18
150. (increment c18)
   changed: (value c18) from 84 to 88
   goals met: 13 of 18
151. (increment c17)
   changed: (value c17) from 87 to 97
   goals met: 12 of 18
152. (increment c18)
   changed: (value c18) from 88 to 92
   goals met: 12 of 18
153. (increment c18)
   changed: (value c18) from 92 to 96
   goals met: 12 of 18
154. (increment c18)
   changed: (value c18) from 96 to 100
   goals met: 13 of 18
155. (decrement c16)
   changed: (value c16) from 97 to 96
   goals met: 14 of 18
156. (decrement c8)
   changed: (value c8) from 65 to 58
   goals met: 15 of 18
157. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 15 of 18
158. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 15 of 18
159. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 15 of 18
160. (increment c8)
   changed: (value c8) from 58 to 65
   goals met: 14 of 18
161. (decrement c7)
   changed: (value c7) from 70 to 67
   goals met: 14 of 18
162. (decrement c7)
   changed: (value c7) from 67 to 64
   goals met: 15 of 18
163. (decrement c1)
   changed: (value c1) from 61 to 51
   goals met: 16 of 18
164. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 16 of 18
165. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 16 of 18
166. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 16 of 18
167. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 16 of 18
168. (increment c1)
   changed: (value c1) from 51 to 61
   goals met: 15 of 18
169. (decrement c0)
   changed: (value c0) from 67 to 63
   goals met: 15 of 18
170. (decrement c0)
   changed: (value c0) from 63 to 59
   goals met: 16 of 18
171. (decrement c1)
   changed: (value c1) from 61 to 51
   goals met: 16 of 18
172. (decrement c0)
   changed: (value c0) from 59 to 55
   goals met: 16 of 18
173. (decrement c0)
   changed: (value c0) from 55 to 51
   goals met: 16 of 18
174. (decrement c0)
   changed: (value c0) from 51 to 47
   goals met: 17 of 18
175. (decrement c8)
   changed: (value c8) from 65 to 58
   goals met: 17 of 18
176. (decrement c7)
   changed: (value c7) from 64 to 61
   goals met: 17 of 18
177. (decrement c7)
   changed: (value c7) from 61 to 58
   goals met: 16 of 18
178. (decrement c7)
   changed: (value c7) from 58 to 55
   goals met: 17 of 18
179. (decrement c6)
   changed: (value c6) from 58 to 48
   goals met: 17 of 18
180. (decrement c5)
   changed: (value c5) from 57 to 55
   goals met: 16 of 18
181. (decrement c5)
   changed: (value c5) from 55 to 53
   goals met: 16 of 18
182. (decrement c5)
   changed: (value c5) from 53 to 51
   goals met: 16 of 18
183. (decrement c5)
   changed: (value c5) from 51 to 49
   goals met: 16 of 18
184. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 16 of 18
185. (decrement c5)
   changed: (value c5) from 49 to 47
   goals met: 17 of 18
186. (decrement c4)
   changed: (value c4) from 56 to 51
   goals met: 16 of 18
187. (decrement c4)
   changed: (value c4) from 51 to 46
   goals met: 17 of 18
188. (decrement c3)
   changed: (value c3) from 55 to 49
   goals met: 16 of 18
189. (decrement c3)
   changed: (value c3) from 49 to 43
   goals met: 17 of 18
190. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 17 of 18
191. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 17 of 18
192. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 17 of 18
193. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 17 of 18
194. (decrement c2)
   changed: (value c2) from 54 to 50
   goals met: 16 of 18
195. (decrement c2)
   changed: (value c2) from 50 to 46
   goals met: 16 of 18
196. (decrement c2)
   changed: (value c2) from 46 to 42
   goals met: 17 of 18
197. (decrement c1)
   changed: (value c1) from 51 to 41
   goals met: 17 of 18
198. (decrement c0)
   changed: (value c0) from 47 to 43
   goals met: 17 of 18
199. (decrement c0)
   changed: (value c0) from 43 to 39
   goals met: 18 of 18
